geier99/STM32-CAN_CubeMX_Tests/STM32-Test/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN1_Init(void);
static void MX_CAN2_Init(void);
static void MX_WWDG_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* hcan);
void HAL_SYSTICK_Callback(void);  // handle own additional systicks
static void USER_CANx_Init(CAN_HandleTypeDef *hCANx,enBitrate baud, uint32_t canMode);



/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
    uint32_t i;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN1_Init();
  MX_CAN2_Init();
  MX_WWDG_Init();
  MX_USB_DEVICE_Init();

  /* USER CODE BEGIN 2 */
  
    USER_CANx_Init(&hcan1,enCanBaudrate,CAN_MODE_NORMAL);   // overwrite the cubeMX initialization
    USER_CANx_Init(&hcan2,enCanBaudrate,CAN_MODE_NORMAL);   // first init it with 100kbit   todo: remvoe onyl init from lawicell opoen commands

    HAL_GPIO_WritePin(LED_RED_GPIO_Port,LED_RED_Pin,GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED_BLUE_GPIO_Port,LED_BLUE_Pin,GPIO_PIN_RESET);
    
    HAL_GPIO_WritePin(CAN_RS_GPIO_Port,CAN_RS_Pin,GPIO_PIN_RESET);  // enable 82C250  HS

   
    
    hcan1.pTxMsg = &myTxMessage;
    
    myTxMessage.DLC = 4;
    myTxMessage.StdId = 0x234;
    
    myTxMessage.IDE = CAN_ID_STD;
    
    
    HAL_CAN_Transmit_IT(&hcan1);
    
    myFilter.FilterNumber           = 0;
    myFilter.FilterMode             = CAN_FILTERMODE_IDMASK;
    myFilter.FilterScale            = CAN_FILTERSCALE_32BIT;
    myFilter.FilterIdHigh           = 0x0000;
    myFilter.FilterIdLow            = 0x0000;
    myFilter.FilterMaskIdHigh       = 0x0000;
    myFilter.FilterMaskIdLow        = 0x0000;
    myFilter.FilterFIFOAssignment   = 0;
    myFilter.FilterActivation       = ENABLE;
    
    HAL_CAN_ConfigFilter(&hcan1,&myFilter);
    

    hcan1.pRxMsg=  &myRxMessage;
    if (HAL_CAN_Receive_IT(&hcan1, CAN_FIFO0) != HAL_OK) {
        /* Reception Error */
        HAL_GPIO_WritePin(LED_RED_GPIO_Port,LED_RED_Pin,GPIO_PIN_RESET);
    }    
    

    myTxMessage.DLC = 3;
    myTxMessage.ExtId = 0x14F00500;
    
    myTxMessage.IDE = CAN_ID_EXT;
    myTxMessage.Data[0] = 0xAA;


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
      
    

    HAL_CAN_Receive_IT(&hcan1,CAN_FIFO0);
      
    
  



      
      
    if(!pTicks->ledTicks) {
        pTicks->ledTicks = LED_TICKS;

        if(!pStatus->interface_flags.CanChannelOnOff) {  // Wenn CAN geschlossen dann Power-LED toggeln
            HAL_GPIO_TogglePin(LED_RED_GPIO_Port,LED_RED_Pin);
        }
        else {
            HAL_GPIO_WritePin(LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET);
        }


        
       // HAL_GPIO_TogglePin(LED_GREEN_GPIO_Port,LED_GREEN_Pin);
    }

    if(!pTicks->canTransmitDelay) {
        pTicks->canTransmitDelay = CAN_TRANSMIT_DELAY;
        
        HAL_CAN_Transmit_IT(&hcan1);

        // CDC_Transmit_FS(usbHelloMsg,strlen((const char *)usbHelloMsg));

    }
    

    if(myWriteIndexLastLine!=myReadIndexLastLine) {  // neuen Commandostring empfangen?

        i= sprintf((char*)strReceivedCommando,"%s",myLastLine[myReadIndexLastLine]);  // Befehl kopieren als sring

        // für debugzwecken einen Pong machen
        #ifdef PING_PONG
            CDC_Transmit_FS((unsigned char *)strReceivedCommando,i);   // CAN-Hacker don't want echos :-)
        #endif


        switch (strReceivedCommando[0]) {           // execute Lawicel commands

            case 'V':
                CDC_Transmit_FS((unsigned char *) STM32_CAN_SW_VERSION, sizeof(STM32_CAN_SW_VERSION)-1 );
            break;
        
            case 'v':
                CDC_Transmit_FS((unsigned char *) STM32_CAN_HW_VERSION, sizeof(STM32_CAN_HW_VERSION)-1 );
            break;

            /* Place for the other Lawicel commands :-)
            
            
            */
            
            case 'S':  // set Baudrat S0..S9  , only allowed the CAN channel is closed
                if ( (strReceivedCommando[1] >='0') &&  (strReceivedCommando[1] <='9') && (!pStatus->interface_flags.CanChannelOnOff)  ) {  // parmeter okay? and channel closed?
                    SetCanBaudrate(usbBaudSettings[strReceivedCommando[1]-0x30]);
                    pStatus->interface_flags.BaudSettingsReceived=1;

                    strReceivedCommando[0]=0x0D;             
                    CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
                }
                else {                         // wrong Parameter  ==> 0x07 senden
                    strReceivedCommando[0]=0x07;             
                    CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
                    
                    pStatus->interface_flags.BaudSettingsReceived=0;  // wegen falscher Baudrate zurücksetzen
                }                    
            break;
                
            case 's':  //Benutzerdefinierete Baudrate setzen  (erstmal nur s8333 für 83.33kbit und s3333 für 33,33kbit)
                if (    (strReceivedCommando[1] =='8') && (strReceivedCommando[2] =='3') \
                    &&  (strReceivedCommando[3] =='3') && (strReceivedCommando[4] =='3') \
                    && (!pStatus->interface_flags.CanChannelOnOff)  ) {  // valid parameter and channel closed?
                    SetCanBaudrate(usbBaudSettings[_83_kbit]);
                    pStatus->interface_flags.BaudSettingsReceived=1;

                    strReceivedCommando[0]=0x0D;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
                else {
                    if ( (strReceivedCommando[1] =='3') &&  (strReceivedCommando[2] =='3') \
                     &&  (strReceivedCommando[3] =='3') &&  (strReceivedCommando[4] =='3') \
                     &&  (!pStatus->interface_flags.CanChannelOnOff)  ) {  // gültige Zahl und Kanal geschlossen?
                        SetCanBaudrate(usbBaudSettings[_33_kbit]);
                        pStatus->interface_flags.BaudSettingsReceived=1;

