geier99/STM32-CAN_CubeMX_Tests/STM32-Test/Src/main.c
                        strReceivedCommando[0]=0x0D;             
                        CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                    }
                    else {
                        if ( (strReceivedCommando[1] =='9') &&  (strReceivedCommando[2] =='5') \
                         &&  (strReceivedCommando[3] =='0') &&  (strReceivedCommando[4] =='0') \
                         &&  (!pStatus->interface_flags.CanChannelOnOff)  ) {  // gültige Zahl und Kanal geschlossen?
                            SetCanBaudrate(usbBaudSettings[_95_kbit]);
                            pStatus->interface_flags.BaudSettingsReceived=1;

                            strReceivedCommando[0]=0x0D;             
                            CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                        }
                        else {
                           // wrong parameter ==> send 0x07 
                            strReceivedCommando[0]=0x07;             
                            CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                            
                            // todo flag setzen, dass fehlerhafte Baudrate empfangen wurde und somit der OpenBefehl nicht ausgefürht werden darf,
                            // solange nicht eine korrekte benutzerdefinierte Baudreate bzw. ein S1..S9 empfangen wurde
                            pStatus->interface_flags.BaudSettingsReceived=0;  // because of wrong baudrate received don't execute "Channel Open"
                        }
                    }                    
                }
            break;
                
                
            case 'O':    // CAN-Kanal öffnen (Kanal muss geschlossen sein)
                pStatus->interface_flags.CanSilentModeOnOff = 0x00;  // normaler Modus
                pStatus->TimeStampCounter=0;
                if((!pStatus->interface_flags.CanChannelOnOff) && (pStatus->interface_flags.BaudSettingsReceived)) { // Kanal geschlossen und Baudrate schon empfangen?

//                    todo aw ############### aaaaaaaaaaaaaaaaaaa
//                    vInitCanWithScannedBaudrate(&CAN_InitStructure,&CAN_FilterInitStructure,CAN_Mode_Normal);
                    USER_CANx_Init(&hcan1,enCanBaudrate,CAN_MODE_NORMAL); 
                    USER_CANx_Init(&hcan2,enCanBaudrate,CAN_MODE_NORMAL); 

                    pStatus->interface_flags.CanChannelOnOff=1;  // Flag auf offen setzen
                    strReceivedCommando[0]=0x0D;             
                    
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
                else {  // ist schon offen
                    strReceivedCommando[0]=0x07;  

                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
            break;
    

            case 'C':       // CAN-Kanal Schliessen    (Kanal muss offen sein
                if(pStatus->interface_flags.CanChannelOnOff) { // Kanal offen?

//                    todo aw aaaaaaaaaaaaaaaa
//                    #ifdef USE_CAN1
//                        CAN_ITConfig(CAN1, CAN_IT_FMP0, DISABLE);
//                        CAN_ITConfig(CAN1, CAN_IT_FMP1, DISABLE);
//                        CAN_DeInit(CAN1);
//                    #endif
//                    #ifdef USE_CAN2
//                        CAN_ITConfig(CAN2, CAN_IT_FMP0, DISABLE);
//                        CAN_ITConfig(CAN2, CAN_IT_FMP1, DISABLE);
//                        CAN_DeInit(CAN2);
//                    #endif    
    
                    pStatus->interface_flags.CanChannelOnOff=0;  // Flag auf geschlossen setzen
                    
                    strReceivedCommando[0]=0x0D;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 

                    HAL_GPIO_WritePin(LED_GREEN_GPIO_Port,LED_GREEN_Pin,GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_BLUE_GPIO_Port,LED_BLUE_Pin,GPIO_PIN_RESET);

                }
                else {  // ist schon  geschlossen
                    strReceivedCommando[0]=0x07;             
                    CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                }
            break;
                
                
                case 'L':  //ListenOnly-Mod    darf nur gesetzt werden, wenn der Channel geschlossen ist
                    
                    pStatus->interface_flags.CanSilentModeOnOff = 0x01;
                
                    pStatus->TimeStampCounter=0;
                    if((!pStatus->interface_flags.CanChannelOnOff) && (pStatus->interface_flags.BaudSettingsReceived)) { // Kanal geschlossen und Baudrate schon empfangen?

                        // todo aw aaaaaaaaaaaaaaaa
                        // vInitCanWithScannedBaudrate(&CAN_InitStructure,&CAN_FilterInitStructure, CAN_Mode_Silent);
                        USER_CANx_Init(&hcan1,enCanBaudrate,CAN_MODE_SILENT); 
                        USER_CANx_Init(&hcan2,enCanBaudrate,CAN_MODE_SILENT); 
                        
    
                        pStatus->interface_flags.CanChannelOnOff=1;  // Flag auf offen setzen
                        strReceivedCommando[0]=0x0D;             

                        //USB_SIL_Write(EP1_IN, (u8 *)strReceivedCommando, 1);
                        CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                                
                        
                    }
                    else {  // ist schon offen
                        strReceivedCommando[0]=0x07;  

                        //USB_SIL_Write(EP1_IN, (u8 *)strReceivedCommando, 1);
                        CDC_Transmit_FS((u8 *)strReceivedCommando,1); 
                    }
                break;
                                
                                
                
                

                
            case 'Z':  // Status für den Zeitstempel setzen
                strReceivedCommando[0]=0x0D;  
                if(strReceivedCommando[1]=='1') {
                    pStatus->interface_flags.TimeStampOnOff=1;
                }
                else {
                    if (strReceivedCommando[1]=='0') {
                        pStatus->interface_flags.TimeStampOnOff=0;
                    }
                    else {  // unbekannter Status, Fehlercode setzen
                        strReceivedCommando[0]=0x07;  
                    }
                }
                CDC_Transmit_FS((u8 *)strReceivedCommando,1); 

            break;
            

                
            case 0x07:                              // Lawicel: error received?  also set by receiving more than 20 chars without [CR]
                CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
            
            default:
                strReceivedCommando[0]=0x07;        // send error back by receiving unknown command
                CDC_Transmit_FS((unsigned char *)strReceivedCommando,1);
            
            break;
         }   // end switch commds

        if(myReadIndexLastLine < (MAX_USB_RECEIVED_BUFFER - 1)) {      //  Schreib index für den Empfangsbuffer eins weiter bzw. auf Anfang setzen
            myReadIndexLastLine += 1;                                  
        }
        else {
            myReadIndexLastLine = 0;
        }
    }  // Ende neuer Commandostring empfangen



    
        
      
